tamapochi1/Sonar/Documents/an_r01an2238jj0121_usb/workspace/RX65N/r_dtc_rx/src/r_dtc_rx.c
    r_dtc_clear_all_dtce_bits();

#endif /* DTC_ENABLE == DTC_CFG_DISABLE_ALL_ACT_SOURCE */

    /* Cancel module stop for DMAC and DTC. */
    r_dtc_module_enable();
    /* Set DTC Vector Table Base Register. */
    DTC.DTCVBR = dtc_table_work2;

#if (DTC_ENABLE == DTC_CFG_USE_SEQUENCE_TRANSFER)
    dtc_table_work2 = (dtc_table_work2 + 0x400);

    /* Set address of the dtc index table. */
    DTC.DTCIBR = dtc_table_work2;
#endif /* (DTC_ENABLE == DTC_CFG_USE_SEQUENCE_TRANSFER) */

    /* Set DTC address mode. */
#if (DTC_ENABLE == DTC_CFG_SHORT_ADDRESS_MODE)
    DTC.DTCADMOD.BIT.SHORT = 1;
#else /* Full-address mode */
    DTC.DTCADMOD.BIT.SHORT = 0;
#endif /* DTC_CFG_SHORT_ADDRESS_MODE */

    /* Set the Transfer Data Read Skip bit. */
#if (DTC_ENABLE == DTC_CFG_TRANSFER_DATA_READ_SKIP_EN) /* Enable Data Read Skip. */
    DTC.DTCCR.BIT.RRS = 1;
#else /* Disable Data Read Skip. */
    DTC.DTCCR.BIT.RRS = 0;
#endif /* DTC_TRANSFER_DATA_READ_SKIP_EN */
    g_is_opened = true; /* DTC module is initialized successfully. */

    return DTC_SUCCESS;
}

/*******************************************************************************
* Function Name: R_DTC_Create
* Description  : Creates the transfer data for a specified interrupt source.
* Arguments    : act_source -
*                    Activation source
*                p_transfer_data -
*                    Pointer to start address of Transfer data area on RAM
*                p_data_cfg -
*                    Pointer to contains the settings for Transfer data
*                chain_transfer_nr -
*                    Number of chain transfer
* Return Value : DTC_SUCCESS -
*                    Successful operation
*                DTC_ERR_NOT_OPEN -
*                    The DTC is not initialized yet.
*                DTC_ERR_INVALID_ARG -
*                    Parameters are invalid.
*                DTC_ERR_NULL_PTR -
*                    The pointers are NULL.
*******************************************************************************/
dtc_err_t R_DTC_Create(dtc_activation_source_t act_source, dtc_transfer_data_t *p_transfer_data,
                       dtc_transfer_data_cfg_t *p_data_cfg, uint32_t chain_transfer_nr)
{
    uint32_t  count       = chain_transfer_nr + 1;
    uint32_t *ptr         = NULL;
    uint8_t   dtce_backup = 0;
    uint8_t   rrs_backup  = 0;
    dtc_err_t ret = DTC_SUCCESS;

    ret = r_dtc_check_create_param(p_transfer_data, p_data_cfg);
    if (DTC_SUCCESS != ret)
    {
        return ret;
    }

    if (false == g_is_opened) /* DTC is not initialized yet. */
    {
        r_dtc_release_hw_lock();
        return DTC_ERR_NOT_OPEN;
    }

    /* Store old value of DTCERn.DTCE bit. */
    dtce_backup = ICU.DTCER[act_source].BIT.DTCE;
    /* Disable the interrupt source. Clear the DTCER */
    ICU.DTCER[act_source].BIT.DTCE = 0;

    /* Store old value of DTCCR.RRS bit. */
    rrs_backup = DTC.DTCCR.BIT.RRS;
    /* Clear RRS bit. */
    DTC.DTCCR.BIT.RRS = 0;

    /* The row in Vector table corresponding to act_source */
    ptr = (uint32_t *)((uint32_t)DTC.DTCVBR + (4 * act_source));
    /* Write start address of Transfer data to Vector table. */
    *ptr = (uint32_t)p_transfer_data;

    while (count > 0)
    {

#if (DTC_IP_VER_DTCb <= DTC_IP)
        /* Set the 0 value. */
        p_data_cfg->writeback_disable        = DTC_WRITEBACK_ENABLE;
        p_data_cfg->sequence_end             = DTC_SEQUENCE_TRANSFER_CONTINUE;
        p_data_cfg->refer_index_table_enable = DTC_REFER_INDEX_TABLE_DISABLE;
        p_data_cfg->disp_add_enable          = DTC_SRC_ADDR_DISP_ADD_DISABLE;
#endif /* (DTC_IP_VER_DTCb <= DTC_IP) */

        if (DTC_SUCCESS != r_dtc_set_transfer_data(p_transfer_data, p_data_cfg))
        { /* Fail to apply configurations for Transfer data. */
            /* Restore RRS bit */
            DTC.DTCCR.BIT.RRS = rrs_backup;
            /* Restore the DTCE bit. */
            ICU.DTCER[act_source].BIT.DTCE = dtce_backup;
            return DTC_ERR_INVALID_ARG;
        }
        else
        {
            p_data_cfg++;
            p_transfer_data++;
        }
        count--;
    }

    /* Restore RRS bit. */
    DTC.DTCCR.BIT.RRS = rrs_backup;
    /* Restore the DTCE bit. */
    ICU.DTCER[act_source].BIT.DTCE = dtce_backup;

    return DTC_SUCCESS;
}

/*******************************************************************************
* Function Name: R_DTC_CreateSeq
* Description  : Creates the sequence transfer data for a specified interrupt source.
* Arguments    : act_source -
*                    Activation source
*                p_transfer_data -
*                    Pointer to start address of Transfer data area on RAM
*                p_data_cfg -
*                    Pointer to contains the settings for Transfer data
*                sequence_transfer_nr -
*                    Number of sequence transfer
*                sequence_no
*                    Sequence number
* Return Value : DTC_SUCCESS -
*                    Successful operation
*                DTC_ERR_NOT_OPEN -
*                    The DTC is not initialized yet.
*                DTC_ERR_INVALID_ARG -
*                    Parameters are invalid.
*                DTC_ERR_NULL_PTR -
*                    The pointers are NULL.
*******************************************************************************/
dtc_err_t R_DTC_CreateSeq(dtc_activation_source_t act_source, dtc_transfer_data_t *p_transfer_data,
                          dtc_transfer_data_cfg_t *p_data_cfg, uint32_t sequence_transfer_nr,
                          uint8_t sequence_no)
{
#if (DTC_DISABLE == DTC_CFG_USE_SEQUENCE_TRANSFER)
    return DTC_ERR_INVALID_ARG;
#else
    uint32_t  count       = sequence_transfer_nr;
    uint32_t *ptr         = NULL;
    uint8_t   dtce_backup = 0;
    uint8_t   rrs_backup  = 0;
    dtc_err_t ret = DTC_SUCCESS;

    if (0 != count)
    {
        ret = r_dtc_check_create_param(p_transfer_data, p_data_cfg);
        if (DTC_SUCCESS != ret)
        {
            return ret;
        }
    }

    if (false == g_is_opened) /* DTC is not initialized yet. */
    {
        r_dtc_release_hw_lock();
        return DTC_ERR_NOT_OPEN;
    }

    /* Store old value of DTCERn.DTCE bit. */
    dtce_backup = ICU.DTCER[act_source].BIT.DTCE;
    /* Disable the interrupt source. Clear the DTCER */
    ICU.DTCER[act_source].BIT.DTCE = 0;

    /* Store old value of DTCCR.RRS bit. */
    rrs_backup = DTC.DTCCR.BIT.RRS;
    /* Clear RRS bit. */
    DTC.DTCCR.BIT.RRS = 0;

    /* The row in dtc index table corresponding to sequence_no. */
    ptr = (uint32_t *)((uint32_t)DTC.DTCIBR + (4 * sequence_no));

