tamapochi1/Sonar/Documents/an_r01an2238jj0121_usb/workspace/RX65N/r_dtc_rx/src/r_dtc_rx.c
    if (0 == count)
    {
        /* Set the cpu interrupt to the sequence number. */
        *ptr = DTC_INVALID_CMND;
    }
    else
    {
        /* Write start address of Transfer data to dtc index table. */
        *ptr = (uint32_t)p_transfer_data;

        while (count > 0)
        {
            if (DTC_SUCCESS != r_dtc_set_transfer_data(p_transfer_data, p_data_cfg))
            { /* Fail to apply configurations for Transfer data. */
                /* Restore RRS bit */
                DTC.DTCCR.BIT.RRS = rrs_backup;
                /* Restore the DTCE bit. */
                ICU.DTCER[act_source].BIT.DTCE = dtce_backup;
                return DTC_ERR_INVALID_ARG;
            }
            else
            {
                p_data_cfg++;
                p_transfer_data++;
            }
            count--;
        }
    }

    /* Restore RRS bit. */
    DTC.DTCCR.BIT.RRS = rrs_backup;
    /* Restore the DTCE bit. */
    ICU.DTCER[act_source].BIT.DTCE = dtce_backup;

    return DTC_SUCCESS;
#endif /* (DTC_DISABLE == DTC_CFG_USE_SEQUENCE_TRANSFER) */
}

/*******************************************************************************
* Function Name: R_DTC_Close
* Description  : Disables power of DTC module.
* Arguments    : None
* Return Value : DTC_SUCCESS -
*                    Successful operation
*                DTC_SUCCESS_DMAC_BUSY -
*                    One or some DMAC resources are locked by another process.
*******************************************************************************/
dtc_err_t R_DTC_Close(void)
{
    /* Clear DTCE bits. */
    r_dtc_clear_all_dtce_bits();

    /* Stop DTC module. */
    DTC.DTCST.BIT.DTCST = 0;

    /* DTC is closed. */
    g_is_opened = false;

    free((void *)g_dtc_table_work[1]);
    g_dtc_table_work[1] = NULL;

    /* Check DMAC locking. */
    if (true == r_dtc_check_DMAC_locking_sw())
    {
        /* Disable the power for DTC and DMAC module. */
        r_dtc_module_disable();
        /* Release hardware lock. */
        r_dtc_release_hw_lock();
    }
    else
    {
        /* Release hardware lock. */
        r_dtc_release_hw_lock();
        return DTC_SUCCESS_DMAC_BUSY;
    }

    return DTC_SUCCESS;
}

/*******************************************************************************
* Function Name: R_DTC_Control
* Description  : Starts / Stops DTC, enables or disables Data transfer read skip,
*                selects an interrupt source as DTC activation.
* Arguments    : command -
*                    Action will be done
*                p_stat -
*                    Pointer to the status of DTC module when command is 
*                     DTC_CMD_GET_STATUS, casted to void *.
*                p_args -
*                    Pointer to argument of command, casted to void *.
* Return Value : DTC_SUCCESS -
*                    Successful operation
*                DTC_ERR_NOT_OPEN -
*                    The DTC is not initialized yet.
*                DTC_ERR_INVALID_COMMAND -
*                    Command parameters are invalid.
*                DTC_ERR_NULL_PTR -
*                    The argument is NULL when commnad is valid.
*                DTC_ERR_ACT -
*                    Data transfer is in progress.
*******************************************************************************/
dtc_err_t R_DTC_Control(dtc_command_t command, dtc_stat_t *p_stat, dtc_cmd_arg_t *p_args)
{
#if (1 == DTC_CFG_PARAM_CHECKING_ENABLE)

    if ((DTC_CMD_STATUS_GET == command) && (NULL == p_stat))
    {
        return DTC_ERR_NULL_PTR;
    }
    else if ((DTC_CMD_ACT_SRC_ENABLE == command) || (DTC_CMD_ACT_SRC_DISABLE == command) || 
             (DTC_CMD_CHAIN_TRANSFER_ABORT == command) || (DTC_CMD_SEQUENCE_TRANSFER_ENABLE == command))
    {
        if (NULL == p_args) /* Require argument */
        {
            return DTC_ERR_NULL_PTR;
        }
    }
    else
    {
        /* do nothing */
    }

#endif /* DTC_CFG_PARAM_CHECKING_ENABLE */

    if (false == g_is_opened)
    {
        r_dtc_release_hw_lock();
        return DTC_ERR_NOT_OPEN;
    }

    switch (command)
    {
        case DTC_CMD_DTC_START: /* Start DTC module. */
            DTC.DTCST.BIT.DTCST = 1;
        break;

        case DTC_CMD_DTC_STOP: /* Stop DTC module. */
            DTC.DTCST.BIT.DTCST = 0;
        break;

        case DTC_CMD_DATA_READ_SKIP_ENABLE: /* Enable Transfer Data Read Skip. */
            DTC.DTCCR.BIT.RRS = 1;
        break;

        case DTC_CMD_DATA_READ_SKIP_DISABLE: /* Disable Transfer Data Read Skip. */
            DTC.DTCCR.BIT.RRS = 0;
        break;

        case DTC_CMD_ACT_SRC_ENABLE: /* Select one interrupt as a DTC activation source. */
            ICU.DTCER[p_args->act_src].BIT.DTCE = 1;
        break;

        case DTC_CMD_ACT_SRC_DISABLE: /* Remove one interrupt as a DTC activation source. */
            ICU.DTCER[p_args->act_src].BIT.DTCE = 0;
        break;

        case DTC_CMD_STATUS_GET:
            if (0 == (DTC.DTCSTS.WORD & DTC_ACT_BIT_MASK)) /* DTC transfer operation is not in progress. */
            {
                p_stat->in_progress = false;
                /* DTC is not in progress. -> vector number is invalid. */
            }
            else /* DTC transfer operation is in progress. */
            {
                p_stat->in_progress = true;
                /* Get the current vector number. */
                p_stat->vect_nr = (uint8_t)(DTC.DTCSTS.WORD & DTC_VECT_NR_MASK); /* get lower 8 bits: 0-7*/
            }
        break;

        case DTC_CMD_CHAIN_TRANSFER_ABORT:
            r_dtc_abort_chain_transfer(p_args->chain_transfer_nr);
        break;
#if (DTC_IP_VER_DTCb <= DTC_IP)
        case DTC_CMD_SEQUENCE_TRANSFER_ENABLE:
            /* Set the sequence transfer vector number and 
               sequence transfer is enabled. */
            DTC.DTCSQE.WORD = (DTC_ESPSEL_BIT_MASK | (uint16_t)p_args->act_src);
        break;

        case DTC_CMD_SEQUENCE_TRANSFER_DISABLE:
            /* Sequence transfer is disabled. */
            DTC.DTCSQE.WORD &= ~DTC_ESPSEL_BIT_MASK;
        break;

        case DTC_CMD_SEQUENCE_TRANSFER_ABORT:
            if (DTC.DTCSTS.WORD & DTC_ACT_BIT_MASK) /* DTC transfer operation is in progress. */
            {
                if (DTC.DTCSTS.BIT.VECN == DTC.DTCSQE.BIT.VECN)
                {
                    return DTC_ERR_ACT;
                }
            }
            /* Abort the sequence transfer. */
            DTC.DTCOR.BIT.SQTFRL = 1;
        break;
#endif /* (DTC_IP_VER_DTCb <= DTC_IP) */
        default:
            return DTC_ERR_INVALID_COMMAND;
        break;
    }

    return DTC_SUCCESS;
}

