tamapochi1/Sonar/Documents/an_r01an2238jj0121_usb/workspace/RX65N/r_dtc_rx/src/r_dtc_rx.c
/*******************************************************************************
* Function Name: R_DTC_GetVersion
* Description  : Returns the version of this module. The version number is 
*                encoded such that the top two bytes are the major version
*                number and the bottom two bytes are the minor version number.
* Arguments    : none
* Return Value : version number
*******************************************************************************/
uint32_t R_DTC_GetVersion(void)
{
    uint32_t version = 0;

    version = (DTC_VERSION_MAJOR << 16) | DTC_VERSION_MINOR;

    return version;
}

/*******************************************************************************
* Function Name: r_dtc_set_transfer_data
* Description  : Applies configurations to a Transfer data area, it is an internal
*                function called by R_DTC_Create(); and all arguments are validated
*                in R_DTC_Create()
* Arguments    : transfer_data -
*                    Start address of Transfer data
*                data_cfg -
*                    Contains configurations for the Transfer data
* Return Value : DTC_SUCCESS -
*                    Apply configurations for Transfer data successfully.
*                DTC_ERR_INVALID_ARG
*                    Fail to apply configurations for Transfer data.
*******************************************************************************/
static dtc_err_t r_dtc_set_transfer_data(dtc_transfer_data_t *p_transfer_data,
                                   dtc_transfer_data_cfg_t *p_cfg)
{
    dtc_mra_t                          t_mra;
    dtc_mrb_t                          t_mrb;
    dtc_cra_t                          t_cra;
    dtc_crb_t                          t_crb;
    volatile dtc_internal_registers_t *td_ptr = (volatile dtc_internal_registers_t *)p_transfer_data;

    /* Set for MRA - . */
#if (DTC_IP_VER_DTCb <= DTC_IP)
    dtc_mrc_t                          t_mrc;

    t_mra.BYTE = (uint8_t)(p_cfg->writeback_disable | p_cfg->src_addr_mode |
                           p_cfg->data_size | p_cfg->transfer_mode);
    t_mrb.BYTE = (uint8_t)(p_cfg->sequence_end |
                           p_cfg->refer_index_table_enable | p_cfg->dest_addr_mode |
                           p_cfg->repeat_block_side | p_cfg->response_interrupt |
                           p_cfg->chain_transfer_enable | p_cfg->chain_transfer_mode);
    t_mrc.BYTE = (uint8_t)(p_cfg->disp_add_enable);
#else
    t_mra.BYTE = (uint8_t)(p_cfg->src_addr_mode | p_cfg->data_size | p_cfg->transfer_mode);
    t_mrb.BYTE = (uint8_t)(p_cfg->dest_addr_mode | p_cfg->repeat_block_side | p_cfg->response_interrupt |
                           p_cfg->chain_transfer_enable | p_cfg->chain_transfer_mode);
#endif /* (DTC_IP_VER_DTCb <= DTC_IP) */

    switch (t_mra.BIT.MD) /* DTC transfer mode */
    {
        case 0x0: /* Normal mode */
            if (DTC_MAX_16BITS_COUNT_VAL == p_cfg->transfer_count)/* Transfer count = 65536 */
            {
                t_cra.WORD = 0x0000;
            }
            else /* 1 - 65535 */
            {
                t_cra.WORD = (uint16_t)p_cfg->transfer_count;
            }
        break;

        case 0x1: /* Repeat mode */
            /* Set counter. */
            if (p_cfg->transfer_count < DTC_MAX_8BITS_COUNT_VAL) /* count 1-255 */
            {
                t_cra.BYTE.CRA_H = (uint8_t)p_cfg->transfer_count;
                t_cra.BYTE.CRA_L = (uint8_t)p_cfg->transfer_count;
            }
            else if (DTC_MAX_8BITS_COUNT_VAL == p_cfg->transfer_count)
            {
                t_cra.BYTE.CRA_H = 0x00;
                t_cra.BYTE.CRA_L = 0x00;
            }
            else /* Transfer count > 256 */
            {
                return DTC_ERR_INVALID_ARG;
            }
        break;

        case 0x2: /* DTC_TRANSFER_MODE_BLOCK - Block transfer mode */
            /* Set counter. */
            if (DTC_MAX_16BITS_COUNT_VAL == p_cfg->transfer_count)/* Transfer count = 65536 */
            {
                t_crb.WORD = 0x0000;
            }
            else /* 1 - 65535 */
            {
                t_crb.WORD = (uint16_t)p_cfg->transfer_count;
            }

            if (p_cfg->block_size < DTC_MAX_8BITS_COUNT_VAL) /* Block size 1-255 */
            {
                t_cra.BYTE.CRA_H = (uint8_t)p_cfg->block_size;
                t_cra.BYTE.CRA_L = (uint8_t)p_cfg->block_size;
            }
            else if (DTC_MAX_8BITS_COUNT_VAL == p_cfg->block_size) /* Block size = 256 */
            {
                t_cra.BYTE.CRA_H = 0;
                t_cra.BYTE.CRA_L = 0;
            }
            else /* Invalid block size */
            {
                return DTC_ERR_INVALID_ARG;
            }
        break;

        default:
            return DTC_ERR_INVALID_ARG;
        break;
    }

#if (DTC_ENABLE == DTC_CFG_SHORT_ADDRESS_MODE) /* Short-address mode */
    /* settings for fist long word: MRA & SAR */
    td_ptr->FIRST_LWORD.LWORD   =  0; /* clear */
    td_ptr->FIRST_LWORD.REG.MRA =  t_mra; /* 1 byte MRA */
    td_ptr->FIRST_LWORD.LWORD   |= (p_cfg->source_addr & 0x00FFFFFF); /* 3 byte SAR */

    /* settings for second long word: MRB & DAR */
    td_ptr->SECOND_LWORD.LWORD   =  0; /* clear */
    td_ptr->SECOND_LWORD.REG.MRB =  t_mrb; /* 1 byte MRB */
    td_ptr->SECOND_LWORD.LWORD   |= (p_cfg->dest_addr & 0x00FFFFFF); /* 3 byte DAR */

    /* settings for third long word: CRA & CRB */
    td_ptr->THIRD_LWORD.REG.CRA.WORD = t_cra.WORD;
    td_ptr->THIRD_LWORD.REG.CRB.WORD = t_crb.WORD;

#else /* Full-address mode */
    /* settings for fist long word: MRA & MRB */
    td_ptr->FIRST_LWORD.REG.MRA.BYTE = t_mra.BYTE; /* 1 byte MRA */
    td_ptr->FIRST_LWORD.REG.MRB.BYTE = t_mrb.BYTE; /* 1 byte MRB */
#if (DTC_IP_VER_DTCb <= DTC_IP)
    td_ptr->FIRST_LWORD.REG.MRC.BYTE = t_mrc.BYTE; /* 1 byte MRC */
#endif /* (DTC_IP_VER_DTCb <= DTC_IP) */

    /* settings for second long word: SAR */
    td_ptr->SECOND_LWORD.SAR = p_cfg->source_addr; /* 4 byte SAR */

